[Killed] ObjectLiteral
src/app/admin/page.tsx:13:5
 };
 
 const breadcrumbs = [
-    { label: "Home", href: "/" },
+    {},
     { label: "Administração", href: "/admin" },
 ];
killedBy: AdminPage should render breadcrumbs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,8 @@
  Object {
    "breadcrombs": Array [

[Killed] BlockStatement
src/app/admin/page.tsx:17:37
     { label: "Administração", href: "/admin" },
 ];
 
-export default function AdminPage() {
-    return (
-        <div className="container mx-auto mt-4">
-            <Suspense>
-                <AdminbreadcrumbsSetter breadcrombs={breadcrumbs} />
-            </Suspense>
-            <ul>
-                <li className="bg-zinc-100 p-4 rounded-lg mb-4 hover:underline">
-                    <Link
-                        href="/admin/products"
-                        className="flex items-center gap-2 hover:text-primary transition-colors"
-                    >
-                        <Shirt />
-                        <span>Produtos</span>
-                    </Link>
-                </li>
-            </ul>
-        </div>
-    );
-}
+export default function AdminPage() {}
 
killedBy: AdminPage should show the products link
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "link" and name `/Produtos/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
