[Killed] BlockStatement
src/app/(home)/layout.tsx:8:5
     children,
 }: Readonly<{
     children: React.ReactNode;
-}>) {
-    return (
-        <>
-            <Navbar />
-            {children}
-            <Footer />
-        </>
-    );
-}
+}>) {}
 
killedBy: HomeLayout renders the main layout with children
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
