[Killed] ObjectLiteral
src/app/layout.tsx:9:35
 import "./globals.css";
 import { Suspense } from "react";
 
-export const metadata: Metadata = {
-    title: {
-        template: "%s | Atrito Boutique",
-        default: "Atrito Boutique",
-    },
-    description: "Loja de roupas e acessórios",
-};
+export const metadata: Metadata = {};
 
 export default function RootLayout({
killedBy: Metadata has the correct title and description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "description": "Loja de roupas e acessórios",
-   "title": Object {

[Killed] StringLiteral
src/app/layout.tsx:11:19
 
 export const metadata: Metadata = {
     title: {
-        template: "%s | Atrito Boutique",
+        template: "",
         default: "Atrito Boutique",
     },
killedBy: Metadata has the correct title and description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "Loja de roupas e acessórios",
    "title": Object {

[Killed] StringLiteral
src/app/layout.tsx:12:18
 export const metadata: Metadata = {
     title: {
         template: "%s | Atrito Boutique",
-        default: "Atrito Boutique",
+        default: "",
     },
     description: "Loja de roupas e acessórios",
killedBy: Metadata has the correct title and description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "description": "Loja de roupas e acessórios",
    "title": Object {

[Killed] BlockStatement
src/app/layout.tsx:21:5
     children,
 }: Readonly<{
     children: React.ReactNode;
-}>) {
-    return (
-        <ClerkProvider
-            localization={ptBR}
-            afterSignOutUrl="/"
-            signInUrl="/signup"
-            signUpForceRedirectUrl="/"
-            signInForceRedirectUrl="/"
-        >
-            <html lang="pt-BR">
-                <body>
-                    <main className="min-h-screen bg-white text-neutral-900">
-                        {children}
-                    </main>
-                    <Toaster richColors position="bottom-center" />
-                    <Suspense>
-                        <UrlToaster />
-                    </Suspense>
-                </body>
-            </html>
-        </ClerkProvider>
-    );
-}
+}>) {}
 
killedBy: Layout renders the layout with children
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
