[Killed] BlockStatement
src/app/loading.tsx:3:35
 import Spinner from "@/components/Spinner";
 
-export default function Loading() {
-    return (
-        <div className="flex flex-col items-center justify-center h-screen">
-            <div className="text-gray-500 text-xl">Carregando... </div>
-            <div className="mt-4">
-                <Spinner size={64} />
-            </div>
-        </div>
-    );
-}
+export default function Loading() {}
 
killedBy: Loading renders a loading indicator
statusReason: TestingLibraryElementError: Unable to find an element with the text: Carregando.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
