[Killed] BlockStatement
src/app/admin/layout.tsx:9:5
     children,
 }: Readonly<{
     children: React.ReactNode;
-}>) {
-    return (
-        <BreadcrumbProvider>
-            <div className="flex flex-col min-h-screen">
-                <AdminNavbar />
-                <div className="flex-1 container mx-auto">{children}</div>
-                <Footer />
-            </div>
-        </BreadcrumbProvider>
-    );
-}
+}>) {}
 
killedBy: AdminLayout matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `AdminLayout matches snapshot 1`

- Snapshot  - 20
+ Received  +  1

- <div>
