[Survived] StringLiteral
src/app/admin/page.tsx:9:18
 
 export const metadata: Metadata = {
     title: "Administração",
-    description: "Loja de roupas e acessórios",
+    description: "",
 };
 

[Killed] BlockStatement
src/app/admin/page.tsx:12:37
     description: "Loja de roupas e acessórios",
 };
 
-export default function AdminPage() {
-    const breadcrumbs = [
-        { label: "Home", href: "/" },
-        { label: "Administração", href: "/admin" },
-    ];
-
-    return (
-        <div className="container mx-auto mt-4">
-            <Suspense>
-                <AdminbreadcrumbsSetter breadcrombs={breadcrumbs} />
-            </Suspense>
-            <ul>
-                <li className="bg-zinc-100 p-4 rounded-lg mb-4 hover:underline">
-                    <Link
-                        href="/admin/products"
-                        className="flex items-center gap-2 hover:text-primary transition-colors"
-                    >
-                        <Shirt />
-                        <span>Produtos</span>
-                    </Link>
-                </li>
-            </ul>
-        </div>
-    );
-}
+export default function AdminPage() {}
 
killedBy: AdminPage should show the products link
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "link" and name `/Produtos/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>

[Survived] StringLiteral
src/app/admin/page.tsx:15:18
 export default function AdminPage() {
     const breadcrumbs = [
         { label: "Home", href: "/" },
-        { label: "Administração", href: "/admin" },
+        { label: "", href: "/admin" },
     ];
 

[Survived] StringLiteral
src/app/admin/page.tsx:15:41
 export default function AdminPage() {
     const breadcrumbs = [
         { label: "Home", href: "/" },
-        { label: "Administração", href: "/admin" },
+        { label: "Administração", href: "" },
     ];
 
