[Killed] BlockStatement
app/signup/[[...signup]]/layout.tsx:5:4
     children,
 }: {
     children: React.ReactNode;
-}) {
-    return (
-        <div className="min-h-screen bg-white text-neutral-900">{children}</div>
-    );
-}
+}) {}
 
killedBy: RootLayout renders the main layout with children
statusReason: TestingLibraryElementError: Unable to find an element with the text: Test Content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
