[Killed] ObjectLiteral
app/signup/[[...signup]]/page.tsx:8:15
 import { redirect } from "next/navigation";
 
 const signUpAppearance = {
-    elements: {
-        footerAction: {
-            display: "none",
-        },
-    },
+    elements: {},
 };
 
killedBy: SignUpPage should not show the footer of the login form
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 5
+ Received  + 1

  Object {
    "appearance": Object {
-     "elements": Object {

[Killed] StringLiteral
app/signup/[[...signup]]/page.tsx:10:22
 const signUpAppearance = {
     elements: {
         footerAction: {
-            display: "none",
+            display: "",
         },
     },
killedBy: SignUpPage should not show the footer of the login form
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "appearance": Object {
      "elements": Object {

[Killed] BlockStatement
app/signup/[[...signup]]/page.tsx:15:44
     },
 };
 
-export default async function SignUpPage() {
-    const user = await currentUser();
-    if (user) {
-        return redirect("/");
-    }
-
-    return (
-        <div className="flex flex-col items-center justify-center min-h-screen gap-8 py-8">
-            <h1 className="text-5xl md:text-9xl font-andes">Atrito</h1>
-            <ClerkLoader
-                fallback={
-                    <div className="mt-20 flex-1">
-                        <Spinner size={64} />
-                    </div>
-                }
-            >
-                <div className="flex flex-col md:flex-row items-start justify-center gap-8 flex-1">
-                    <SignUp signInUrl="" appearance={signUpAppearance} />
-                    <div className="text-3xl font-bold mt-20">Ou</div>
-                    <SignIn />
-                </div>
-            </ClerkLoader>
-        </div>
-    );
-}
+export default async function SignUpPage() {}
 
killedBy: SignUpPage should not show the footer of the login form
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
app/signup/[[...signup]]/page.tsx:17:9
 
 export default async function SignUpPage() {
     const user = await currentUser();
-    if (user) {
+    if (true) {
         return redirect("/");
     }
killedBy: SignUpPage should not show the footer of the login form
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
app/signup/[[...signup]]/page.tsx:17:9
 
 export default async function SignUpPage() {
     const user = await currentUser();
-    if (user) {
+    if (false) {
         return redirect("/");
     }
killedBy: SignUpPage when user is logged in redirects to the home page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"

Number of calls: 0
