[Killed] MethodExpression
src/components/admin/AdminBreadcrumbs.tsx:20:24
 export default function AdminBreadcrumbs() {
     const [breadcrumbs] = useBreadcrumbContext();
 
-    const allButLast = breadcrumbs.slice(0, -1);
+    const allButLast = breadcrumbs;
     const last = breadcrumbs.at(-1);
 
killedBy: AdminBreadcrumbs should render several breadcrumbs in the correct order when several breadcrumbs are provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

@@ -2,6 +2,8 @@
    "Home",
    "",

[Killed] UnaryOperator
src/components/admin/AdminBreadcrumbs.tsx:20:45
 export default function AdminBreadcrumbs() {
     const [breadcrumbs] = useBreadcrumbContext();
 
-    const allButLast = breadcrumbs.slice(0, -1);
+    const allButLast = breadcrumbs.slice(0, +1);
     const last = breadcrumbs.at(-1);
 
killedBy: AdminBreadcrumbs should render several breadcrumbs when several breadcrumbs are provided
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Admin
Received:
  HomeSettings

[Killed] UnaryOperator
src/components/admin/AdminBreadcrumbs.tsx:21:33
     const [breadcrumbs] = useBreadcrumbContext();
 
     const allButLast = breadcrumbs.slice(0, -1);
-    const last = breadcrumbs.at(-1);
+    const last = breadcrumbs.at(+1);
 
     return (
killedBy: AdminBreadcrumbs should render one breadcrumb when one breadcrumb is provided
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Home
Received:

[Killed] BlockStatement
src/components/admin/AdminBreadcrumbs.tsx:26:54
     return (
         <Breadcrumb>
             <BreadcrumbList>
-                {allButLast.map(({ label, href }) => {
-                    return (
-                        <Fragment key={href}>
-                            <BreadcrumbItem key={href}>
-                                <BreadcrumbLink href={href}>
-                                    {label}
-                                </BreadcrumbLink>
-                            </BreadcrumbItem>
-                            <BreadcrumbSeparator />
-                        </Fragment>
-                    );
-                })}
+                {allButLast.map(({ label, href }) => {})}
                 {last && (
                     <BreadcrumbItem key={last.href}>
killedBy: AdminBreadcrumbs should render several breadcrumbs when several breadcrumbs are provided
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Home
Received:
  Settings

[Killed] ConditionalExpression
src/components/admin/AdminBreadcrumbs.tsx:38:18
                         </Fragment>
                     );
                 })}
-                {last && (
-                    <BreadcrumbItem key={last.href}>
-                        <BreadcrumbLink
-                            href={last.href}
-                            className="hover:text-primary transition-colors"
-                        >
-                            {last.label}
-                        </BreadcrumbLink>
-                    </BreadcrumbItem>
-                )}
+                {false}
             </BreadcrumbList>
         </Breadcrumb>
killedBy: AdminBreadcrumbs should render one breadcrumb when one breadcrumb is provided
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Home
Received:

[Killed] LogicalOperator
src/components/admin/AdminBreadcrumbs.tsx:38:18
                         </Fragment>
                     );
                 })}
-                {last && (
-                    <BreadcrumbItem key={last.href}>
-                        <BreadcrumbLink
-                            href={last.href}
-                            className="hover:text-primary transition-colors"
-                        >
-                            {last.label}
-                        </BreadcrumbLink>
-                    </BreadcrumbItem>
-                )}
+                {last || <BreadcrumbItem key={last.href}>
+                        <BreadcrumbLink href={last.href} className="hover:text-primary transition-colors">
+                            {last.label}
+                        </BreadcrumbLink>
+                    </BreadcrumbItem>}
             </BreadcrumbList>
         </Breadcrumb>
killedBy: AdminBreadcrumbs should render an empty breadcrumb when no breadcrumbs are provided
statusReason: TypeError: Cannot read properties of undefined (reading 'href')

[Survived] BlockStatement
src/components/admin/AdminBreadcrumbs.tsx:57:71
     breadcrombs: Item[];
 };
 
-export function AdminbreadcrumbsSetter(props: BreadcrumbContextProps) {
-    const [, setBreadcrumbs] = useBreadcrumbContext();
-
-    useEffect(() => {
-        setBreadcrumbs(props.breadcrombs);
-    });
-
-    return null;
-}
+export function AdminbreadcrumbsSetter(props: BreadcrumbContextProps) {}
 

[Survived] BlockStatement
src/components/admin/AdminBreadcrumbs.tsx:60:21
 export function AdminbreadcrumbsSetter(props: BreadcrumbContextProps) {
     const [, setBreadcrumbs] = useBreadcrumbContext();
 
-    useEffect(() => {
-        setBreadcrumbs(props.breadcrombs);
-    });
+    useEffect(() => {});
 
     return null;
