[Killed] BlockStatement
src/components/Footer.tsx:1:34
-export default function Footer() {
-    return (
-        <footer className="text-center text-sm text-gray-500 py-6 border-t">
-            © {new Date().getFullYear()} Atrito. Todos os direitos reservados.
-        </footer>
-    );
-}
+export default function Footer() {}
 
killedBy: Footer renders the footer with current year
statusReason: TestingLibraryElementError: Unable to find an element with the text: /© 2025 Atrito. Todos os direitos reservados./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
