[Killed] BlockStatement
src/components/ClientUserButton.tsx:5:44
 
 import { SignedIn, UserButton } from "@clerk/nextjs";
 
-export default function ClientUserButton() {
-    return (
-        <SignedIn>
-            <UserButton />
-        </SignedIn>
-    );
-}
+export default function ClientUserButton() {}
 
killedBy: ClientUserButton renders SignedIn component
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="signed-in"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
