[Killed] BlockStatement
src/components/auth/AdminOnly.tsx:8:65
     children: React.ReactNode;
 };
 
-export default function AdminOnly({ children }: AdminOnlyProps) {
-    const auth = useAuth();
-
-    if (!auth.isLoaded) {
-        return null;
-    }
-
-    const adminUser =
-        auth.isSignedIn && auth.sessionClaims?.metadata.role === "admin";
-
-    return adminUser ? <>{children}</> : null;
-}
+export default function AdminOnly({ children }: AdminOnlyProps) {}
 
killedBy: AdminOnly when the user is autehnticated and is an admin should render the children
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
src/components/auth/AdminOnly.tsx:11:9
 export default function AdminOnly({ children }: AdminOnlyProps) {
     const auth = useAuth();
 
-    if (!auth.isLoaded) {
+    if (true) {
         return null;
     }
killedBy: AdminOnly when the user is autehnticated and is an admin should render the children
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BooleanLiteral
src/components/auth/AdminOnly.tsx:11:9
 export default function AdminOnly({ children }: AdminOnlyProps) {
     const auth = useAuth();
 
-    if (!auth.isLoaded) {
+    if (auth.isLoaded) {
         return null;
     }
killedBy: AdminOnly when the user is autehnticated and is an admin should render the children
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] EqualityOperator
src/components/auth/AdminOnly.tsx:16:28
     }
 
     const adminUser =
-        auth.isSignedIn && auth.sessionClaims?.metadata.role === "admin";
+        auth.isSignedIn && auth.sessionClaims?.metadata.role !== "admin";
 
     return adminUser ? <>{children}</> : null;
killedBy: AdminOnly when the user is autehnticated and is not an admin should not render the children
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Test</h1> instead

[Killed] ConditionalExpression
src/components/auth/AdminOnly.tsx:16:9
     }
 
     const adminUser =
-        auth.isSignedIn && auth.sessionClaims?.metadata.role === "admin";
+        false;
 
     return adminUser ? <>{children}</> : null;
killedBy: AdminOnly when the user is autehnticated and is an admin should render the children
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
