[Killed] BlockStatement
src/components/auth/ClerkLoader.tsx:14:22
 export default function ClerkLoader({
     children,
     fallback = null,
-}: ClerkLoaderProps) {
-    const { isLoaded } = useUser();
-
-    if (!isLoaded) {
-        return fallback;
-    }
-
-    return <>{children}</>;
-}
+}: ClerkLoaderProps) {}
 
killedBy: ClerkLoader renders fallback when not loaded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/auth/ClerkLoader.tsx:17:9
 }: ClerkLoaderProps) {
     const { isLoaded } = useUser();
 
-    if (!isLoaded) {
+    if (true) {
         return fallback;
     }
killedBy: ClerkLoader renders children when loaded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Protected Content. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading...
    </div>

[Killed] ConditionalExpression
src/components/auth/ClerkLoader.tsx:17:9
 }: ClerkLoaderProps) {
     const { isLoaded } = useUser();
 
-    if (!isLoaded) {
+    if (false) {
         return fallback;
     }
killedBy: ClerkLoader renders fallback when not loaded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Protected Content
    </div>
