[Killed] BlockStatement
src/components/NavbarUserArea.tsx:6:42
 import AdminOnly from "./auth/AdminOnly";
 import { SignedIn, SignedOut, UserButton, useUser } from "@clerk/nextjs";
 
-export default function NavbarUserArea() {
-    const { isLoaded } = useUser();
-
-    if (!isLoaded) {
-        return null;
-    }
-
-    return (
-        <nav className="space-x-6 text-sm font-medium flex items-center">
-            <AdminOnly>
-                <Link href="/admin" className="hover:text-primary">
-                    Administração
-                </Link>
-            </AdminOnly>
-            <SignedOut>
-                <Link href="/signup" className="hover:text-primary">
-                    Entrar / Registrar-se
-                </Link>
-            </SignedOut>
-            <SignedIn>
-                <UserButton />
-            </SignedIn>
-        </nav>
-    );
-}
+export default function NavbarUserArea() {}
 
killedBy: NavbarUserArea when the component is loaded and the the user is not logged in should show the register link
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "link" and name `/registrar-se/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<bo

[Killed] BooleanLiteral
src/components/NavbarUserArea.tsx:9:9
 export default function NavbarUserArea() {
     const { isLoaded } = useUser();
 
-    if (!isLoaded) {
+    if (isLoaded) {
         return null;
     }
killedBy: NavbarUserArea when the component is not loaded should return null
statusReason: Error: expect(received).toBeNull()

Received: <nav class="space-x-6 text-sm font-medium flex items-center" />

[Killed] BlockStatement
src/components/NavbarUserArea.tsx:9:20
 export default function NavbarUserArea() {
     const { isLoaded } = useUser();
 
-    if (!isLoaded) {
-        return null;
-    }
+    if (!isLoaded) {}
 
     return (
killedBy: NavbarUserArea when the component is not loaded should return null
statusReason: Error: expect(received).toBeNull()

Received: <nav class="space-x-6 text-sm font-medium flex items-center" />
