[Killed] BlockStatement
src/components/Spinner.tsx:7:62
     size?: number;
 };
 
-export default function Spinner({ size = 32 }: SpinnerProps) {
-    return (
-        <LoaderCircle
-            className="animate-spin"
-            size={size}
-            color="currentColor"
-        />
-    );
-}
+export default function Spinner({ size = 32 }: SpinnerProps) {}
 
killedBy: Spinner renders without crashing
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
