[Killed] BlockStatement
src/components/UrlToaster.tsx:8:38
 import { toast } from "sonner";
 import { ErrorMessage, errorMessages } from "@/config/messages";
 
-export default function UrlToaster() {
-    const searchParams = useSearchParams();
-    const router = useRouter();
-    const pathname = usePathname();
-
-    useEffect(() => {
-        const error = searchParams.get("error");
-
-        if (error && error in errorMessages) {
-            toast.error(errorMessages[error as ErrorMessage]);
-            const newParams = new URLSearchParams(searchParams.toString());
-            newParams.delete("error");
-            router.replace(`${pathname}?${newParams.toString()}`, {
-                scroll: false,
-            });
-        }
-    });
-
-    return null;
-}
+export default function UrlToaster() {}
 
killedBy: UrlToaster should not call a toast if the error in search params is not a valid key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "error"

Number of calls: 0

[Killed] BlockStatement
src/components/UrlToaster.tsx:13:21
     const router = useRouter();
     const pathname = usePathname();
 
-    useEffect(() => {
-        const error = searchParams.get("error");
-
-        if (error && error in errorMessages) {
-            toast.error(errorMessages[error as ErrorMessage]);
-            const newParams = new URLSearchParams(searchParams.toString());
-            newParams.delete("error");
-            router.replace(`${pathname}?${newParams.toString()}`, {
-                scroll: false,
-            });
-        }
-    });
+    useEffect(() => {});
 
     return null;
killedBy: UrlToaster should not call a toast if the error in search params is not a valid key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "error"

Number of calls: 0

[Killed] LogicalOperator
src/components/UrlToaster.tsx:16:13
     useEffect(() => {
         const error = searchParams.get("error");
 
-        if (error && error in errorMessages) {
+        if (error || error in errorMessages) {
             toast.error(errorMessages[error as ErrorMessage]);
             const newParams = new URLSearchParams(searchParams.toString());
killedBy: UrlToaster should not call a toast if the error in search params is not a valid key
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: undefined

[Killed] ConditionalExpression
src/components/UrlToaster.tsx:16:13
     useEffect(() => {
         const error = searchParams.get("error");
 
-        if (error && error in errorMessages) {
+        if (false) {
             toast.error(errorMessages[error as ErrorMessage]);
             const newParams = new URLSearchParams(searchParams.toString());
killedBy: UrlToaster should call a toast if the error in search params is a valid key
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/components/UrlToaster.tsx:20:28
             toast.error(errorMessages[error as ErrorMessage]);
             const newParams = new URLSearchParams(searchParams.toString());
             newParams.delete("error");
-            router.replace(`${pathname}?${newParams.toString()}`, {
+            router.replace(``, {
                 scroll: false,
             });
killedBy: UrlToaster should replace the search params is a valid key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- StringContaining "/test-path",
+ "",
  {"scroll": false},

[Killed] BooleanLiteral
src/components/UrlToaster.tsx:21:25
             const newParams = new URLSearchParams(searchParams.toString());
             newParams.delete("error");
             router.replace(`${pathname}?${newParams.toString()}`, {
-                scroll: false,
+                scroll: true,
             });
         }
killedBy: UrlToaster should replace the search params is a valid key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/test-path?",
  Object {
-   "scroll": false,
