[Killed] BlockStatement
src/components/Navbar.tsx:4:34
 import Link from "next/link";
 import NavbarUserArea from "./NavbarUserArea";
 
-export default function Navbar() {
-    return (
-        <header className="flex items-center justify-between px-6 py-4 border-b shadow-sm">
-            <h1 className="text-6xl font-andes">
-                <Link href="/">Atrito</Link>
-            </h1>
-            <NavbarUserArea />
-        </header>
-    );
-}
+export default function Navbar() {}
 
killedBy: Navbar the Atrito header must be a link to home page
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading" and name `/Atrito/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
