[Killed] BlockStatement
src/contexts/BreadcrumbProvider.tsx:25:5
     children,
 }: Readonly<{
     children: React.ReactNode;
-}>) {
-    const [breadcrumbs, setBreadcrumbs] = useState<BreadcrumbItem[]>([]);
-    return (
-        <BreadCrumbContext.Provider value={[breadcrumbs, setBreadcrumbs]}>
-            {children}
-        </BreadCrumbContext.Provider>
-    );
-}
+}>) {}
 
 export function useBreadcrumbContext() {
killedBy: BreadcrumbProvider should provide initial empty breadcrumbs
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="breadcrumbs"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/contexts/BreadcrumbProvider.tsx:34:40
     );
 }
 
-export function useBreadcrumbContext() {
-    const context = useContext(BreadCrumbContext);
-    if (!context) {
-        throw new Error(
-            "useBreadcrumbContext must be used within a BreadcrumbProvider"
-        );
-    }
-    return context;
-}
+export function useBreadcrumbContext() {}
 
killedBy: BreadcrumbProvider should throw an error if used outside of BreadcrumbProvider
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "useBreadcrumbContext must be used within a BreadcrumbProvider"

Received function did not throw

[Killed] BooleanLiteral
src/contexts/BreadcrumbProvider.tsx:36:9
 
 export function useBreadcrumbContext() {
     const context = useContext(BreadCrumbContext);
-    if (!context) {
+    if (context) {
         throw new Error(
             "useBreadcrumbContext must be used within a BreadcrumbProvider"
killedBy: BreadcrumbProvider should throw an error if used outside of BreadcrumbProvider
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "useBreadcrumbContext must be used within a BreadcrumbProvider"

Received function did not throw

[Killed] ConditionalExpression
src/contexts/BreadcrumbProvider.tsx:36:9
 
 export function useBreadcrumbContext() {
     const context = useContext(BreadCrumbContext);
-    if (!context) {
+    if (false) {
         throw new Error(
             "useBreadcrumbContext must be used within a BreadcrumbProvider"
killedBy: BreadcrumbProvider should throw an error if used outside of BreadcrumbProvider
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "useBreadcrumbContext must be used within a BreadcrumbProvider"

Received function did not throw
