[Killed] BlockStatement
src/middleware.ts:13:3
 export async function adminProtection(
     auth: ClerkMiddlewareAuth,
     req: NextRequest
-) {
-    const { sessionClaims } = await auth();
-    if (
-        isAdminRoute(req) &&
-        (!sessionClaims || sessionClaims.metadata.role !== "admin")
-    ) {
-        const url = req.nextUrl.clone();
-        url.pathname = "";
-        url.searchParams.set("error", "only-admin");
-        return NextResponse.redirect(url);
-    }
-}
+) {}
 
 export default clerkMiddleware(adminProtection);
killedBy: middleware adminProtection when the route is protected and the user is not an admin should redirect if the user is not an admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "xxxx"
Received: undefined

[Killed] LogicalOperator
src/middleware.ts:16:9
 ) {
     const { sessionClaims } = await auth();
     if (
-        isAdminRoute(req) &&
-        (!sessionClaims || sessionClaims.metadata.role !== "admin")
+        isAdminRoute(req) || !sessionClaims || sessionClaims.metadata.role !== "admin"
     ) {
         const url = req.nextUrl.clone();
killedBy: middleware adminProtection when the route is not protectred should not redirect when the user is authenticated
statusReason: TypeError: Cannot read properties of undefined (reading 'clone')

[Killed] ConditionalExpression
src/middleware.ts:16:9
 ) {
     const { sessionClaims } = await auth();
     if (
-        isAdminRoute(req) &&
-        (!sessionClaims || sessionClaims.metadata.role !== "admin")
+        false
     ) {
         const url = req.nextUrl.clone();
killedBy: middleware adminProtection when the route is protected and the user is not an admin should redirect if the user is not an admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "xxxx"
Received: undefined

[Killed] ConditionalExpression
src/middleware.ts:17:28
     const { sessionClaims } = await auth();
     if (
         isAdminRoute(req) &&
-        (!sessionClaims || sessionClaims.metadata.role !== "admin")
+        (!sessionClaims || false)
     ) {
         const url = req.nextUrl.clone();
killedBy: middleware adminProtection when the route is protected and the user is not an admin should redirect if the user is not an admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "xxxx"
Received: undefined

[Killed] BooleanLiteral
src/middleware.ts:17:10
     const { sessionClaims } = await auth();
     if (
         isAdminRoute(req) &&
-        (!sessionClaims || sessionClaims.metadata.role !== "admin")
+        (sessionClaims || sessionClaims.metadata.role !== "admin")
     ) {
         const url = req.nextUrl.clone();
killedBy: middleware adminProtection when the route is protected should not redirect if the user is an admin
statusReason: TypeError: Cannot read properties of undefined (reading 'clone')

[Killed] BlockStatement
src/middleware.ts:18:7
     if (
         isAdminRoute(req) &&
         (!sessionClaims || sessionClaims.metadata.role !== "admin")
-    ) {
-        const url = req.nextUrl.clone();
-        url.pathname = "";
-        url.searchParams.set("error", "only-admin");
-        return NextResponse.redirect(url);
-    }
+    ) {}
 }
 
killedBy: middleware adminProtection when the route is protected and the user is not an admin should redirect if the user is not an admin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "xxxx"
Received: undefined

[Killed] StringLiteral
src/middleware.ts:20:24
         (!sessionClaims || sessionClaims.metadata.role !== "admin")
     ) {
         const url = req.nextUrl.clone();
-        url.pathname = "";
+        url.pathname = "Stryker was here!";
         url.searchParams.set("error", "only-admin");
         return NextResponse.redirect(url);
killedBy: middleware adminProtection when the route is protected and the user is not an admin should redirect and put the error code on the url query param
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://localhost/?error=only-admin"
+ "http://localhost/Stryker%20was%20here!?error=only-admin",

[Killed] StringLiteral
src/middleware.ts:21:39
     ) {
         const url = req.nextUrl.clone();
         url.pathname = "";
-        url.searchParams.set("error", "only-admin");
+        url.searchParams.set("error", "");
         return NextResponse.redirect(url);
     }
killedBy: middleware adminProtection when the route is protected and the user is not an admin should redirect and put the error code on the url query param
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- "http://localhost/?error=only-admin"
+ "http://localhost/?error=",

[Killed] ArrayDeclaration
src/middleware.ts:29:14
 export default clerkMiddleware(adminProtection);
 
 export const config = {
-    matcher: [
-        // Skip Next.js internals and all static files, unless found in search params
-        "/((?!_next|[^?]*\\.(?:html?|css|js(?!on)|jpe?g|webp|png|gif|svg|ttf|woff2?|ico|csv|docx?|xlsx?|zip|webmanifest)).*)",
-        // Always run for API routes
-        "/(api|trpc)(.*)",
-    ],
+    matcher: [],
 };
 
killedBy: middleware should have the correct config.matcher array
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0
