[Killed] StringLiteral
src/config/messages.ts:6:19
 export type ErrorDictionary = Record<ErrorMessage, string>;
 
 export const errorMessages: ErrorDictionary = {
-    "only-admin": "Você precisa ser um administrador para acessar esta página.",
+    "only-admin": "",
 };
 
killedBy: errorMessages should have the correct message for 'only-admin'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Você precisa ser um administrador para acessar esta página."
Received: ""
